run/discInGravity/baseCase_6DoFRBM/constant/sixDoFRigidBodyMotionConstraints
fixedLine
{
    sixDoFRigidBodyMotionConstraint line;
    centreOfRotation (0 0 0);
    direction (0 1 0);
}

fixedOrientation
{
    sixDoFRigidBodyMotionConstraint orientation;
}
